<?php
	$names = "Августа,Авдотья,Аврора,Агата,Аглая,Агнесса,Агния,Ада,Адель,Аза,Азалия,Аида,Аксинья,Акулина,Алевтина,Александра,Алексия,Алёна,Алина,Алиса,Алла,Альберта,Амалия,Анастасия,Ангелина,Андриана,Анеля,Анжела,Анжелика,Анисья,Анита,Анна,Антонина,Анфиса,Апрелия,Ариадна,Арина,Арсения,Ассоль,Астра,Ася,Аурика,Аэлита,Бажена,Беата,Беатриса,Белла,Беляна,Береслава,Берта,Богдана,Божена,Бронислава,Валентина,Валерия,Ванда,Ванесса,Варвара,Василина,Василиса,Васса,Веда,Венера,Вера,Вероника,Веселина,Веста,Вета,Вивиана,Видана,Виктория,Вилора,Виола,Виринея,Виталия,Влада,Владилена,Владимира,Владислава,Власта,Воля,Всеслава,Габриэлла,Гайя,Галина,Гелия,Гелла,Гера,Герда,Глафира,Глория,Грация,Грета,Дайна,Дана,Даниэла,Дарина,Дарья,Дарьяна,Декабрина,Дея,Дженни,Джулия,Диана,Дина,Добрава,Доля,Доминика,Дорофея,Ева,Евгения,Евдокия,Екатерина,Елена,Елизавета,Емельяна,Есения,Ефимия,Ефросиния,Жанна,Жасмин,Ждана,Забава,Залина,Зара,Зарема,Зарина,Звана,Звенислава,Земфира,Зинаида,Зиновия,Зита,Злата,Златослава,Зоряна,Зоя,Иванна,Ивона,Ида,Изабелла,Изольда,Илона,Иля,Инга,Инесса,Инна,Иоанна,Иоланта,Ирина,Ирма,Искра,Июлия,Камилла,Карина,Каролина,Катарина,Кира,Клавдия,Клара,Кристина,Ксения,Лада,Лана,Лара,Лариса,Лаура,Леля,Лера,Леся,Лиана,Лидия,Лика,Лилиана,Лилия,Лина,Линда,Лира,Лия,Лолита,Лора,Луиза,Любава,Любовь,Людмила,Майя,Малика,Мальвина,Маргарита,Марианна,Марина,Мария,Марта,Матрена,Мелания,Мелисса,Мила,Милада,Милана,Милолика,Милослава,Мира,Мирослава,Мишель,Мия,Млада,Моника,Муза,Надежда,Нана,Наталья,Нева,Нелли,Ника,Николина,Николь,Нила,Нина,Нинель,Нона,Оксана,Олеся,Олимпия,Ольга,Пелагея,Полина,Прасковья,Рада,Раиса,Регина,Рената,Риана,Римма,Рита,Роберта,Рогнеда,Роза,Роксана,Ростислава,Рузана,Руслана,Руфина,Сабрина,Сандра,Светлана,Святослава,Северина,Селена,Серафима,Сильвия,Слава,Славяна,Снежана,Соня,София,Станислава,Стелла,Стефания,Таисия,Тамара,Татьяна,Ульяна,Урсула,Услада,Устина,Фаина,Феба,Фекла,Фрида,Хана,Хельга,Хлоя,Христина,Царина,Цветана,Цецилия,Чулпан,Шанель,Шарлотта,Шейла,Эвелина,Эдита,Элеонора,Элина,Элла,Элоиза,Эльвира,Эльза,Эльмира,Эмилия,Эмма,Эрика,Эсмеральда,Эстер,Эшли,Юлиана,Юлия,Юна,Юния,Юнона,Ядвига,Яна,Янина,Ярина,Яромира,Ярослава,Ясмина,Август,Агап,Агафон,Адам,Адриан,Азарий,Аким,Алан,Александр,Алексей,Альберт,Анатолий,Андрей,Антип,Антон,Анфим,Аполлинарий,Арий,Аристарх,Аркадий,Арно,Арнольд,Арсений,Артем,Артемий,Артур,Архип,Афанасий,Боголюб,Болеслав,Борис,Борислав,Бронислав,Вадим,Валентин,Валерий,Вальдемар,Варфоломей,Василий,Ватслав,Велизар,Венедикт,Вениамин,Викентий,Виктор,Вилен,Виссарион,Виталий,Владимир,Владислав,Владлен,Власий,Володар,Всеволод,Вячеслав,Гектор,Геннадий,Георгий,Герасим,Герман,Глеб,Горислав,Григорий,Даниил,Данислав,Демид,Демьян,Денис,Дмитрий,Добрыня,Дорофей,Евгений,Евграф,Евдоким,Евсей,Евстафий,Егор,Елизар,Елисей,Емельян,Еремей,Ермак,Ермил,Ермолай,Ерофей,Ефим,Ефрем,Жан,Захар,Зигмунд,Зиновий,Зосима,Зураб,Иван,Игнат,Игнатий,Игорь,Илларион,Илья,Инокентий,Ипполит,Казимир,Кай,Камиль,Ким,Кир,Кирилл,Клавдий,Клим,Кондрат,Константин,Корней,Корнелий,Кузьма,Лавр,Лаврентий,Лазарь,Ларион,Лев,Леонард,Леонид,Леонтий,Лука,Лукьян,Любомир,Макар,Макарий,Максим,Максимильян,Марк,Маркел,Марсель,Мартин,Матвей,Мечеслав,Микула,Милан,Мирон,Мирослав,Митрофан,Михаил,Модест,Мстислав,Нестор,Никанор,Никита,Никифор,Никодим,Никола,Николай,Олег,Онисим,Орест,Осип,Остап,Павел,Панкрат,Парамон,Пахом,Петр,Порфирий,Потап,Прокофий,Прохор,Радомир,Радослав,Рафаэль,Ренат,Роберт,Родион,Ролан,Роман,Ростислав,Рудольф,Савелий,Светозар,Святослав,Семен,Серафим,Сергей,Спартак,Спиридон,Станислав,Степан,Стефан,Тарас,Терентий,Тимофей,Тихомир,Тихон,Трифон,Трофим,Ульян,Устин,Федор,Федот,Феликс,Феофан,Филарет,Филат,Филимон,Филипп,Фирс,Фома,Фрол,Харитон,Эдуард,Эмилий,Эраст,Эрик,Эрнест,Юлиан,Юлий,Юрий,Юст,Яков,Ян,Януарий,Яромир,Ярослав";

	$arr_names = explode(",", $names);
	require "db_link.php";

	$i = rand(0, count($arr_names)-1);
	$n = $arr_names[$i];

	if (isset($_GET["super"])) {
		$sql = "INSERT INTO users (id, name, role_id)
				VALUES (NULL, '$n', 2)";
		mysqli_query($link, $sql);
	}
	if (isset($_GET["intern"])) {
		$sql = "INSERT INTO users (id, name, role_id)
				VALUES (NULL, '$n', 3)";
		mysqli_query($link, $sql);
	}

	if (isset($_GET["super_intern"])) {
		$super = $_GET["super"];
		$sql = "INSERT INTO menthors (id, supervisor, intern) VALUES ";

		$values = array();

		foreach ($_GET as $key => $value) {
			if (preg_match("/intern_/", $key)) {
				$values[] = "(NULL, $super, $value)";
			}
		}

		$sql .= implode(",", $values);

		mysqli_query($link, $sql);
	}
?>

<form method="GET">
	<input type="submit" name="super"  value="Add supervisor">
	<input type="submit" name="intern" value="Add intern">
</form>

<form method="GET">
	<table>
		<tr>
			<td>super</td>
			<td>intern</td>
		</tr>
		<tr>
			<td>
				<select name="super">
					<?php
						$sql = "SELECT * FROM users
								WHERE role_id=2";
						$result = mysqli_query($link, $sql);


						while ($row = mysqli_fetch_assoc($result)) {
							$id = $row["id"];
							$name = $row["name"];
							$out = "<option value='$id'>$name</option>";
							echo $out;
						}
					?>
				</select>
			</td>
			<td>
				<?php
					$sql = "SELECT users.* FROM users
							LEFT JOIN menthors ON users.id = menthors.intern
							WHERE menthors.intern IS NULL
							AND users.role_id=3";
					$result = mysqli_query($link, $sql);


					while ($row = mysqli_fetch_assoc($result)) {
						$id = $row["id"];
						$name = $row["name"];
						$get_name = "intern_" . $id;
						$out = "<input type='checkbox' name='$get_name' value='$id'>$name<br>";
						echo $out;
					}
				?>
			</td>
		</tr>
	</table>

	<input type="submit" name="super_intern" value="Add interns to super">
</form>